
//Задание 6
ДвухзначноеЧисло = 1511;
Степень = 0;
ГраничноеЗначение = 10000;

Результат = 1; 

Для Индекс = 1 По Степень Цикл
	
	Результат = Результат * ДвухзначноеЧисло;
	
КонецЦикла;

Сообщить (Результат);

Если Результат>ГраничноеЗначение Тогда
	
	Сообщить ("Задание6: Результат превышает граничное значение равное 10000");

Иначе
    Сообщить ("Задание 6: Результат не превышает граничное значение равное 10000");

КонецЕсли;





//Задание 7
КонецГода = КонецГода(ТекущаяДата());

Для Индекс = 1 По 10 Цикл
	                             
	ДеньНедели = ДеньНедели(КонецГода);
	
	Если ДеньНедели = 1 Тогда
		Сообщить ("Задание 7: Понедельник");	
		
	ИначеЕсли ДеньНедели = 2 Тогда
		Сообщить ("Задание 7: Вторник");
		
	ИначеЕсли ДеньНедели = 3 Тогда
		Сообщить ("Задание 7: Среда");
				
	ИначеЕсли ДеньНедели = 4 Тогда
		Сообщить ("Задание 7:Четверг");

	ИначеЕсли ДеньНедели = 5 Тогда
		Сообщить ("Задание 7: Пятница");
		
	ИначеЕсли ДеньНедели = 6 Тогда
		Сообщить ("Задание 7: Суббота");
		
	ИначеЕсли ДеньНедели = 7 Тогда
		Сообщить ("Задание 7: Воскреение");
		
	КонецЕсли;
	
	КонецГода = КонецГода(КонецДня(КонецГода) + 1);
	
КонецЦикла;  



//Задание 9
МассивЧисел = Новый Массив;
МассивЧисел.Добавить(151);
МассивЧисел.Добавить(115);

Для каждого ЭлементМассива Из МассивЧисел Цикл
	Сообщить("Задание 9:");
	Сообщить(ЭлементМассива);

КонецЦикла;

