
Процедура ПройденТестАдминистрированиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	                                       
	   Результат = ПройденТестАдминистрирование;
	
КонецПроцедуры

Процедура ПройденТестПрограммированиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
       Результат = ПройденТестПрограммирование;
	
КонецПроцедуры

Процедура ВакагсияОператор1СПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
    ПредложеннаяВакансия = Перечисления.Вакании.Оператор1С;
	
КонецПроцедуры

Процедура ВакансияАдминистраторПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	ПредложеннаяВакансия = Перечисления.Вакании.Администратор1С;

КонецПроцедуры

Процедура ВакансияПрограммистПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	ПредложеннаяВакансия = Перечисления.Вакании.Программист1С;

КонецПроцедуры
